class MainHW:
    # HW 3.1. Нужно покрыть тестами метод на 100%
    # Метод проверяет, является ли целое число записанное в переменную n, чётным (true) либо нечётным (false).
    @staticmethod
    def is_even(n):
        return n % 2 == 0

    # HW 3.2. Нужно написать метод который проверяет, попадает ли переданное число в интервал (25;100) и возвращает true, если попадает и false - если нет,
    # покрыть тестами метод на 100%
    @staticmethod
    def is_in_range(number):
        return 25 < number < 100
